package org.example;

public class description {
    /**Реализовать информационный обмен между двумя агентами: агент-рабочий (Р) и агент-заказчик (З).
     * З отправлять запрос Р для начала выполнения работ с указанием объема работ
     * (объем работ можно задать абстрактным числом, привязанным к времени выполнения задачи).
     * Р начинает выполнение работы и запускает отдельное поведение для отслеживания выполнения
     * работы в процентах. Каждые несколько секунд Р отсылает отчет о проделанной работе З.
     * При выполнении всей работы З должен отправить Р подтверждение выполнения работы*/
}